1) /home/kpicaza/server/open.sketch/dev/app/Listeners/OpenDocumentWindow.php:72    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         } catch (MissedSketchBookReference) {
             $sketchBookId = Uuid::uuid4()->toString();
             $this->createNewSketchBook->handle(CreateNewSketchBookCommand::withIdAndPath($sketchBookId, $path));
-            $this->saveSketchBook->handle(SaveSketchBookCommand::from($sketchBookId, $sketchBookData['sketches'], $sketchBookData['brush'], $sketchBookData['palette']));
+            
         }
         $this->openWindow->handle(new OpenWindowCommand($sketchBookId, 'sketch-book', $path, 'sketch-book'));
     }
 }

2) /home/kpicaza/server/open.sketch/dev/app/Listeners/OpenDocumentWindow.php:82    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $this->createNewSketchBook->handle(CreateNewSketchBookCommand::withIdAndPath($sketchBookId, $path));
             $this->saveSketchBook->handle(SaveSketchBookCommand::from($sketchBookId, $sketchBookData['sketches'], $sketchBookData['brush'], $sketchBookData['palette']));
         }
-        $this->openWindow->handle(new OpenWindowCommand($sketchBookId, 'sketch-book', $path, 'sketch-book'));
+        
     }
 }

3) /home/kpicaza/server/open.sketch/dev/app/Listeners/StoreDocument.php:37    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             return;
         }
         $command = CreateNewSketchBookCommand::withIdAndPath(Uuid::uuid4()->toString(), $path);
-        $this->createNewSketchBook->handle($command);
+        
         $this->windowManager->handle(new OpenWindowCommand($command->sketchBookId, 'sketch-book', $path, 'sketch-book'));
     }
 }

4) /home/kpicaza/server/open.sketch/dev/app/Listeners/StoreDocument.php:39    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         }
         $command = CreateNewSketchBookCommand::withIdAndPath(Uuid::uuid4()->toString(), $path);
         $this->createNewSketchBook->handle($command);
-        $this->windowManager->handle(new OpenWindowCommand($command->sketchBookId, 'sketch-book', $path, 'sketch-book'));
+        
     }
 }

5) /home/kpicaza/server/open.sketch/dev/src/SketchBook/Domain/Handler/SaveSketchBook.php:22    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function handle(SaveSketchBookCommand $command) : void
     {
         $sketchBook = $this->repository->get($command->sketchBookId);
-        $sketchBook->setBrush($command->brush());
+        
         $sketchBook->setPalette($command->palette());
         $sketchBook->updateSketches(Sketch::fromNormalizedSketches($command->sketches));
         $this->repository->save($sketchBook);
     }
 }

6) /home/kpicaza/server/open.sketch/dev/src/SketchBook/Domain/Handler/SaveSketchBook.php:23    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $sketchBook = $this->repository->get($command->sketchBookId);
         $sketchBook->setBrush($command->brush());
-        $sketchBook->setPalette($command->palette());
+        
         $sketchBook->updateSketches(Sketch::fromNormalizedSketches($command->sketches));
         $this->repository->save($sketchBook);
     }
 }

7) /home/kpicaza/server/open.sketch/dev/src/SketchBook/Domain/Model/SketchBook.php:36    [M] LogicalNot

--- Original
+++ New
@@ @@
     }
     public static function new(string $sketchBookId, string $storagePath) : self
     {
-        if (!str_ends_with($storagePath, '.json')) {
+        if (str_ends_with($storagePath, '.json')) {
             $storagePath = sprintf('%s.json', $storagePath);
         }
         return new self($sketchBookId, $storagePath, [new Sketch(1, 'data:,')], Brush::default(), Palette::default());

8) /home/kpicaza/server/open.sketch/dev/src/SketchBook/Domain/Model/SketchBook.php:85    [M] UnwrapStrReplace

--- Original
+++ New
@@ @@
     }
     public function name() : string
     {
-        return basename(str_replace('.json', '', $this->storagePath));
+        return basename($this->storagePath);
     }
     public function background() : string
     {

9) /home/kpicaza/server/open.sketch/dev/src/SketchBook/Infrastructure/Persistence/FileSystemSketchBookRepository.php:34    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function get(string $sketchBookId) : SketchBook
     {
-        $sketchBookReference = SketchBookReference::firstOrNew(['id' => $sketchBookId]);
+        $sketchBookReference = SketchBookReference::firstOrNew([]);
         if (null === $sketchBookReference->storage_path) {
             throw new MissedSketchBookReference('Sketch Book not found.');
         }

10) /home/kpicaza/server/open.sketch/dev/src/SketchBook/Infrastructure/Persistence/FileSystemSketchBookRepository.php:44    [M] DecrementInteger

--- Original
+++ New
@@ @@
         }
         $content = Storage::get($sketchBookReference->storage_path) ?? '[]';
         /** @var SketchBookNormalized|null $sketchBookNormalized */
-        $sketchBookNormalized = json_decode($content, true, 512, JSON_THROW_ON_ERROR);
+        $sketchBookNormalized = json_decode($content, true, 511, JSON_THROW_ON_ERROR);
     }
 }

11) /home/kpicaza/server/open.sketch/dev/src/SketchBook/Infrastructure/Persistence/FileSystemSketchBookRepository.php:44    [M] IncrementInteger

--- Original
+++ New
@@ @@
         }
         $content = Storage::get($sketchBookReference->storage_path) ?? '[]';
         /** @var SketchBookNormalized|null $sketchBookNormalized */
-        $sketchBookNormalized = json_decode($content, true, 512, JSON_THROW_ON_ERROR);
+        $sketchBookNormalized = json_decode($content, true, 513, JSON_THROW_ON_ERROR);
     }
 }

15) /home/kpicaza/server/open.sketch/dev/src/Window/Infrastructure/Electron/LaravelDialogProvider.php:24    [M] Coalesce

--- Original
+++ New
@@ @@
     public function open() : string
     {
         $storagePath = Storage::disk('user_documents')->path('OpenSketch');
-        $path = $this->dialog->title(__('open_sketch_book'))->asSheet(Window::current()->id ?? 'welcome')->defaultPath($storagePath)->open();
+        $path = $this->dialog->title(__('open_sketch_book'))->asSheet('welcome' ?? Window::current()->id)->defaultPath($storagePath)->open();
         return str_replace(storage_path('app'), '', $path ?? '');
     }
     public function save(string $title, string $path) : ?string

16) /home/kpicaza/server/open.sketch/dev/src/Window/Infrastructure/Electron/LaravelDialogProvider.php:28    [M] UnwrapStrReplace

--- Original
+++ New
@@ @@
     {
         $storagePath = Storage::disk('user_documents')->path('OpenSketch');
         $path = $this->dialog->title(__('open_sketch_book'))->asSheet(Window::current()->id ?? 'welcome')->defaultPath($storagePath)->open();
-        return str_replace(storage_path('app'), '', $path ?? '');
+        return $path ?? '';
     }
     public function save(string $title, string $path) : ?string
     {

17) /home/kpicaza/server/open.sketch/dev/src/Window/Infrastructure/Electron/LaravelDialogProvider.php:31    [M] Coalesce

--- Original
+++ New
@@ @@
     {
         $storagePath = Storage::disk('user_documents')->path('OpenSketch');
         $path = $this->dialog->title(__('open_sketch_book'))->asSheet(Window::current()->id ?? 'welcome')->defaultPath($storagePath)->open();
-        return str_replace(storage_path('app'), '', $path ?? '');
+        return str_replace(storage_path('app'), '', '' ?? $path);
     }
     public function save(string $title, string $path) : ?string
     {

18) /home/kpicaza/server/open.sketch/dev/src/Window/Infrastructure/Electron/LaravelDialogProvider.php:42    [M] Coalesce

--- Original
+++ New
@@ @@
     public function save(string $title, string $path) : ?string
     {
         $storagePath = Storage::disk('user_documents')->path($path);
-        return $this->dialog->title(__($title))->asSheet(Window::current()->id ?? 'welcome')->defaultPath($storagePath)->save();
+        return $this->dialog->title(__($title))->asSheet('welcome' ?? Window::current()->id)->defaultPath($storagePath)->save();
     }
 }

19) /home/kpicaza/server/open.sketch/dev/src/Window/Infrastructure/Electron/LaravelWindowProvider.php:17    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         /** @var \Native\Laravel\Windows\WindowManager $window */
         $window = Window::getFacadeRoot();
-        Window::open('welcome');
+        
         /** @phpstan-ignore-next-line */
         Window::close(Window::current()->id === 'welcome' ? 'sketch-book' : Window::current()->id);
         Window::open($command->openingWindowName)->title(sprintf('%s: %s', __('sketch_book'), $command->fileName()))->route($command->routeName, ['id' => $command->sketchBookId]);

20) /home/kpicaza/server/open.sketch/dev/src/Window/Infrastructure/Electron/LaravelWindowProvider.php:19    [M] Identical

--- Original
+++ New
@@ @@
         $window = Window::getFacadeRoot();
         Window::open('welcome');
         /** @phpstan-ignore-next-line */
-        Window::close(Window::current()->id === 'welcome' ? 'sketch-book' : Window::current()->id);
+        Window::close(Window::current()->id !== 'welcome' ? 'sketch-book' : Window::current()->id);
         Window::open($command->openingWindowName)->title(sprintf('%s: %s', __('sketch_book'), $command->fileName()))->route($command->routeName, ['id' => $command->sketchBookId]);
         $window->maximize($command->openingWindowName);
         Window::close('welcome');
     }
 }

21) /home/kpicaza/server/open.sketch/dev/src/Window/Infrastructure/Electron/LaravelWindowProvider.php:19    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         /** @var \Native\Laravel\Windows\WindowManager $window */
         $window = Window::getFacadeRoot();
         Window::open('welcome');
-        /** @phpstan-ignore-next-line */
-        Window::close(Window::current()->id === 'welcome' ? 'sketch-book' : Window::current()->id);
+        
         Window::open($command->openingWindowName)->title(sprintf('%s: %s', __('sketch_book'), $command->fileName()))->route($command->routeName, ['id' => $command->sketchBookId]);
         $window->maximize($command->openingWindowName);
         Window::close('welcome');
     }
 }

22) /home/kpicaza/server/open.sketch/dev/src/Window/Infrastructure/Electron/LaravelWindowProvider.php:19    [M] Ternary

--- Original
+++ New
@@ @@
         $window = Window::getFacadeRoot();
         Window::open('welcome');
         /** @phpstan-ignore-next-line */
-        Window::close(Window::current()->id === 'welcome' ? 'sketch-book' : Window::current()->id);
+        Window::close(Window::current()->id === 'welcome' ? Window::current()->id : 'sketch-book');
         Window::open($command->openingWindowName)->title(sprintf('%s: %s', __('sketch_book'), $command->fileName()))->route($command->routeName, ['id' => $command->sketchBookId]);
         $window->maximize($command->openingWindowName);
         Window::close('welcome');
     }
 }

23) /home/kpicaza/server/open.sketch/dev/src/Window/Infrastructure/Electron/LaravelWindowProvider.php:22    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         Window::open('welcome');
         /** @phpstan-ignore-next-line */
         Window::close(Window::current()->id === 'welcome' ? 'sketch-book' : Window::current()->id);
-        Window::open($command->openingWindowName)->title(sprintf('%s: %s', __('sketch_book'), $command->fileName()))->route($command->routeName, ['id' => $command->sketchBookId]);
+        
         $window->maximize($command->openingWindowName);
         Window::close('welcome');
     }
 }

24) /home/kpicaza/server/open.sketch/dev/src/Window/Infrastructure/Electron/LaravelWindowProvider.php:24    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         Window::open('welcome');
         /** @phpstan-ignore-next-line */
         Window::close(Window::current()->id === 'welcome' ? 'sketch-book' : Window::current()->id);
-        Window::open($command->openingWindowName)->title(sprintf('%s: %s', __('sketch_book'), $command->fileName()))->route($command->routeName, ['id' => $command->sketchBookId]);
+        Window::open($command->openingWindowName)->title(sprintf('%s: %s', __('sketch_book'), $command->fileName()))->route($command->routeName, []);
         $window->maximize($command->openingWindowName);
         Window::close('welcome');
     }
 }

25) /home/kpicaza/server/open.sketch/dev/src/Window/Infrastructure/Electron/LaravelWindowProvider.php:25    [M] ArrayItem

--- Original
+++ New
@@ @@
         Window::open('welcome');
         /** @phpstan-ignore-next-line */
         Window::close(Window::current()->id === 'welcome' ? 'sketch-book' : Window::current()->id);
-        Window::open($command->openingWindowName)->title(sprintf('%s: %s', __('sketch_book'), $command->fileName()))->route($command->routeName, ['id' => $command->sketchBookId]);
+        Window::open($command->openingWindowName)->title(sprintf('%s: %s', __('sketch_book'), $command->fileName()))->route($command->routeName, ['id' > $command->sketchBookId]);
         $window->maximize($command->openingWindowName);
         Window::close('welcome');
     }
 }

26) /home/kpicaza/server/open.sketch/dev/src/Window/Infrastructure/Electron/LaravelWindowProvider.php:28    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         /** @phpstan-ignore-next-line */
         Window::close(Window::current()->id === 'welcome' ? 'sketch-book' : Window::current()->id);
         Window::open($command->openingWindowName)->title(sprintf('%s: %s', __('sketch_book'), $command->fileName()))->route($command->routeName, ['id' => $command->sketchBookId]);
-        $window->maximize($command->openingWindowName);
+        
         Window::close('welcome');
     }
 }

27) /home/kpicaza/server/open.sketch/dev/src/Window/Infrastructure/Electron/LaravelWindowProvider.php:30    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         Window::close(Window::current()->id === 'welcome' ? 'sketch-book' : Window::current()->id);
         Window::open($command->openingWindowName)->title(sprintf('%s: %s', __('sketch_book'), $command->fileName()))->route($command->routeName, ['id' => $command->sketchBookId]);
         $window->maximize($command->openingWindowName);
-        Window::close('welcome');
+        
     }
 }


Timed Out mutants:
==================

1) /home/kpicaza/server/open.sketch/dev/src/SketchBook/Domain/Handler/DownloadSketch.php:34    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         if (empty($storagePath)) {
             return;
         }
-        $this->imageManipulation->make($sketchBook->sketches()[$from->sketchId - 1]->image, $storagePath);
+        
     }
 }

2) /home/kpicaza/server/open.sketch/dev/src/SketchBook/Domain/Handler/DownloadSketch.php:35    [M] DecrementInteger

--- Original
+++ New
@@ @@
         if (empty($storagePath)) {
             return;
         }
-        $this->imageManipulation->make($sketchBook->sketches()[$from->sketchId - 1]->image, $storagePath);
+        $this->imageManipulation->make($sketchBook->sketches()[$from->sketchId - 0]->image, $storagePath);
     }
 }

3) /home/kpicaza/server/open.sketch/dev/src/SketchBook/Domain/Handler/DownloadSketch.php:35    [M] IncrementInteger

--- Original
+++ New
@@ @@
         if (empty($storagePath)) {
             return;
         }
-        $this->imageManipulation->make($sketchBook->sketches()[$from->sketchId - 1]->image, $storagePath);
+        $this->imageManipulation->make($sketchBook->sketches()[$from->sketchId - 2]->image, $storagePath);
     }
 }

4) /home/kpicaza/server/open.sketch/dev/src/SketchBook/Domain/Handler/DownloadSketch.php:35    [M] Minus

--- Original
+++ New
@@ @@
         if (empty($storagePath)) {
             return;
         }
-        $this->imageManipulation->make($sketchBook->sketches()[$from->sketchId - 1]->image, $storagePath);
+        $this->imageManipulation->make($sketchBook->sketches()[$from->sketchId + 1]->image, $storagePath);
     }
 }

5) /home/kpicaza/server/open.sketch/dev/src/SketchBook/Infrastructure/GD/PNGImageManipulation.php:17    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         list(, $data) = explode(';', $base64Image);
         list(, $data) = explode(',', $data);
-        Storage::put($storagePath, base64_decode($data));
+        
     }
 }
